In [140]:
# 1
li = ['Python', 'is', 'open', 'source']

In [141]:
di = {x:len(x) for x in li}
di

{'Python': 6, 'is': 2, 'open': 4, 'source': 6}

In [142]:
#2
s = str(input('Enter a String'))

t = s.strip().lower()
if t[:] == t[::-1]:
    print("String is Paliandrom")
else:
    print("String is not Paliandrom")

Enter a String Madam madam

String is Paliandrom

In [143]:
# 3
numbers = [12,4,58,62,6565,2224,9999]

second_largest = sorted(numbers, reverse= True)
second_largest[1]

6565

In [144]:
import pandas as pd
import numpy as np

In [145]:
# 4
df = pd.DataFrame({
    'City': ['Pune', 'Mumbai', 'Bangalore', 'Kerala', 'Ahemdabad', 'Pune', 'Mumbai', 'Bangalore', 'Kerala', 'Ahemdabad'],
    'Age':[23,56,24,85,56,32,44,12,25,29]
})

In [146]:
df

        City  Age
0       Pune   23
1     Mumbai   56
2  Bangalore   24
3     Kerala   85
4  Ahemdabad   56
5       Pune   32
6     Mumbai   44
7  Bangalore   12
8     Kerala   25
9  Ahemdabad   29

In [147]:
# 5
df.groupby('City')['Age'].mean()

City
Ahemdabad    42.5
Bangalore    18.0
Kerala       55.0
Mumbai       50.0
Pune         27.5
Name: Age, dtype: float64

In [148]:
# 6
df[(df['Age']>30) & (df['Age']<40)]

   City  Age
5  Pune   32

In [149]:
# 7

In [150]:
df['Age'] = df['Age'].apply(lambda x:x+2)

In [151]:
df

        City  Age
0       Pune   25
1     Mumbai   58
2  Bangalore   26
3     Kerala   87
4  Ahemdabad   58
5       Pune   34
6     Mumbai   46
7  Bangalore   14
8     Kerala   27
9  Ahemdabad   31

In [152]:
# 8: Pivot Table
f1 = pd.DataFrame({"Num": ['one', 'two', 'three', 'four'],
                   "let": ['A', 'B', 'C', 'D'],
                    "li": [1, 2, 3, 4]})
f1.pivot(index='Num', columns='let', values='li')

let      A    B    C    D
Num
four   NaN  NaN  NaN  4.0
one    1.0  NaN  NaN  NaN
three  NaN  NaN  3.0  NaN
two    NaN  2.0  NaN  NaN

In [156]:
#9
df.insert(column = 'Category', loc=2, value = np.nan)

In [154]:
df

        City  Age  Category
0       Pune   25       NaN
1     Mumbai   58       NaN
2  Bangalore   26       NaN
3     Kerala   87       NaN
4  Ahemdabad   58       NaN
5       Pune   34       NaN
6     Mumbai   46       NaN
7  Bangalore   14       NaN
8     Kerala   27       NaN
9  Ahemdabad   31       NaN

In [122]:
df["Category"].apply(lambda x : 'young' if df['Age'] < 30 else 'Adult' for x in df['Age'])

In [90]:
df

        City  Age Category
0       Pune   25     None
1     Mumbai   58     None
2  Bangalore   26     None
3     Kerala   87     None
4  Ahemdabad   58     None
5       Pune   34     None
6     Mumbai   46     None
7  Bangalore   14     None
8     Kerala   27     None
9  Ahemdabad   31     None

In [157]:
# 10
df['Age'].rank()  # Ranks the age from smallest to largest.

0     2.0
1     8.5
2     3.0
3    10.0
4     8.5
5     6.0
6     7.0
7     1.0
8     4.0
9     5.0
Name: Age, dtype: float64